Tekla.Structures.Catalogs.CatalogHandler.GetConnectionStatus
Returns true if a proper connection to the Tekla Structures process has been established.
If, for some reason, the connection has been lost, the method will return false. Currently,
there's no way to re-establish the connection.
Returns: True on success.

Tekla.Structures.Catalogs.CatalogHandler.ImportCustomComponentItems(System.String)
Imports custom component items (*.uel) from folder to component catalog.
Import overrides the existing custom components in the catalog without any warnings.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
if (new CatalogHandler().ImportCustomComponentItems(System.IO.Path.GetTempPath()))
Console.WriteLine("Custom components imported successfully to catalog.");
}
}
path: The path to be used for import.
Returns: true if successful.